pokedex/app/views/api/pokemon/show.json.jbuilder

json.items do
  @pokemon.items.each do |item|
---
SELECT "items"."id" FROM "items" WHERE "items"."pokemon_id" = $1  [["pokemon_id", 1]]